//MERGEJOB   JOB (ACCT),'MERGE SORT',
//            CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//*
//STEP1      EXEC IGYWCL
//COBOL.SYSIN DD DSN=Z54915.COBOL.SOURCE(MERGESRT),DISP=SHR
//LKED.SYSLMOD DD DSN=Z54915.COBOL.SOURCE(MERGESRT),DISP=SHR
//*
//
