       IDENTIFICATION DIVISION.
       PROGRAM-ID. MERGE-SORT-PROGRAM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT INPUT-FILE1 ASSIGN TO 'INPUT1.DAT'
               ORGANIZATION IS SEQUENTIAL.
           SELECT INPUT-FILE2 ASSIGN TO 'INPUT2.DAT'
               ORGANIZATION IS SEQUENTIAL.
           SELECT INPUT-FILE3 ASSIGN TO 'INPUT3.DAT'
               ORGANIZATION IS SEQUENTIAL.
           SELECT OUTPUT-FILE ASSIGN TO 'PRJOUT.DAT'
               ORGANIZATION IS SEQUENTIAL.
           SELECT SORT-FILE ASSIGN TO TEMPORARY.

       DATA DIVISION.
       FILE SECTION.
       FD INPUT-FILE1.
       01 INPUT-RECORD1 PIC X(80).

       FD INPUT-FILE2.
       01 INPUT-RECORD2 PIC X(80).

       FD INPUT-FILE3.
       01 INPUT-RECORD3 PIC X(80).

       FD OUTPUT-FILE.
       01 OUTPUT-RECORD PIC X(80).

       SD SORT-FILE.
       01 SORT-RECORD PIC X(80).


       WORKING-STORAGE SECTION.
       01 WS-EOF1 PIC X VALUE 'N'.
       01 WS-EOF2 PIC X VALUE 'N'.
       01 WS-EOF3 PIC X VALUE 'N'.

       PROCEDURE DIVISION.
       MAIN-PROGRAM.
           PERFORM READ-AND-MERGE
           PERFORM SORT-AND-WRITE
           STOP RUN.

       READ-AND-MERGE.
           OPEN INPUT INPUT-FILE1
           OPEN INPUT INPUT-FILE2
           OPEN INPUT INPUT-FILE3
           OPEN I-O SORT-FILE

           PERFORM UNTIL WS-EOF1 = 'Y'
               READ INPUT-FILE1 INTO INPUT-RECORD1
               AT END MOVE 'Y' TO WS-EOF1
               NOT AT END
                   MOVE INPUT-RECORD1 TO SORT-RECORD
                   WRITE SORT-RECORD
           END-PERFORM

           PERFORM UNTIL WS-EOF2 = 'Y'
               READ INPUT-FILE2 INTO INPUT-RECORD2
               AT END MOVE 'Y' TO WS-EOF2
               NOT AT END
                   MOVE INPUT-RECORD2 TO SORT-RECORD
                   WRITE SORT-RECORD
           END-PERFORM

           PERFORM UNTIL WS-EOF3 = 'Y'
               READ INPUT-FILE3 INTO INPUT-RECORD3
               AT END MOVE 'Y' TO WS-EOF3
               NOT AT END
                   MOVE INPUT-RECORD3 TO SORT-RECORD
                   WRITE SORT-RECORD
           END-PERFORM.

       SORT-AND-WRITE.
           CLOSE INPUT-FILE1
           CLOSE INPUT-FILE2
           CLOSE INPUT-FILE3

           SORT SORT-FILE
               ON ASCENDING KEY SORT-RECORD
               USING SORT-FILE
               GIVING OUTPUT-FILE.

           CLOSE OUTPUT-FILE.